<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4fcebee871a50a4f941d85ea21326529ec5aaa673e7c49abcf1a65ff1bc8a491","plan_job_ref":"Job Commit to main quality checks #65 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/21767691592","plan_out_hash":"a150179432e4a45cf8ae7604c27ba083cce22a8bad684622346d71bcdc6c6cb4","plan_hash":"56a44142807230e34c86ba936265bde0af2a48e43f0554ecec701ee42bd2b6d7","plan_text_format":"diff-trunc","version":"1.49.0","closed":true} -->
Terraform plan in __./__
<details>
<summary>Plan: 4 to add, 36 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories[".github"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = ".github/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.ai-ml.demos"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.ai-ml.demos/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.ai.bookshelf-demo"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.ai.bookshelf-demo/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.azure-devops.library/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.azure-devops.workflows/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github-actions.agent"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.github-actions.agent/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github-actions.library"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.github-actions.library/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github-actions.workflows"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.github-actions.workflows/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github.io"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
            Unauthorized copying of this file, via any medium is strictly prohibited
            Proprietary and confidential
            Written by Benjamin Clark <bclark@sudoblark.com>, 2026
        EOT -> (known after apply)
        id                  = "sudoblark.github.io/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.mobile.silver-bayonet-builder"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
            Unauthorized copying of this file, via any medium is strictly prohibited
            Proprietary and confidential
            Written by Benjamin Clark <bclark@sudoblark.com>, 2026
        EOT -> (known after apply)
        id                  = "sudoblark.mobile.silver-bayonet-builder/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.monsternames.api"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.monsternames.api/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.monsternames.open-api"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.monsternames.open-api/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.patterns.repository-enterprise"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.patterns.repository-enterprise/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.python.bitbucket-cli"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.python.bitbucket-cli/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.python.ci-cli"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.python.ci-cli/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.python.core"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.python.core/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.python.github-cli"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.python.github-cli/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.python.scripts"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
            Unauthorized copying of this file, via any medium is strictly prohibited
            Proprietary and confidential
            Written by Benjamin Clark <bclark@sudoblark.com>, 2026
        EOT -> (known after apply)
        id                  = "sudoblark.python.scripts/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.aws"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.aws"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.aws"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
!~      archived                    = true -> false
        id                          = "sudoblark.terraform.aws"
        name                        = "sudoblark.terraform.aws"
#        (39 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.repositories["sudoblark.terraform.aws"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
            Unauthorized copying of this file, via any medium is strictly prohibited
            Proprietary and confidential
            Written by Benjamin Clark <bclark@sudoblark.com>, 2026
        EOT -> (known after apply)
        id                  = "sudoblark.terraform.aws/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.aws.identity-management"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.aws.identity-management"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.aws.identity-management"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           require_last_push_approval      = false
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories["sudoblark.terraform.aws.identity-management"].github_repository.repository will be created
+   resource "github_repository" "repository" {
+       allow_auto_merge            = false
+       allow_forking               = (known after apply)
+       allow_merge_commit          = true
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "Terraform module to manage the Sudoblark AWS Organisation, inclusive of Identity Manager - repo managed by sudoblark.terraform.github"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_downloads               = true
+       has_issues                  = true
+       has_projects                = true
+       has_wiki                    = true
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "sudoblark.terraform.aws.identity-management"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "aws",
+           "iac",
+           "terraform",
        ]
+       visibility                  = "private"
+       vulnerability_alerts        = (known after apply)
+       web_commit_signoff_required = false

+       security_and_analysis (known after apply)
    }

  # module.repositories["sudoblark.terraform.aws.identity-management"].github_repository_file.codeowners will be created
+   resource "github_repository_file" "codeowners" {
+       autocreate_branch_source_sha = (known after apply)
+       branch                       = "main"
+       commit_message               = "docs/CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha                   = (known after apply)
+       content                      = <<-EOT
            * @benjaminlukeclark
        EOT
+       file                         = "docs/CODEOWNERS"
+       id                           = (known after apply)
+       overwrite_on_create          = true
+       ref                          = (known after apply)
+       repository                   = "sudoblark.terraform.aws.identity-management"
+       sha                          = (known after apply)
    }

  # module.repositories["sudoblark.terraform.aws.identity-management"].github_repository_file.license will be created
+   resource "github_repository_file" "license" {
+       autocreate_branch_source_sha = (known after apply)
+       branch                       = "main"
+       commit_message               = "license.txt - managed by sudoblark.terraform.github"
+       commit_sha                   = (known after apply)
+       content                      = (known after apply)
+       file                         = "LICENSE.txt"
+       id                           = (known after apply)
+       overwrite_on_create          = true
+       ref                          = (known after apply)
+       repository                   = "sudoblark.terraform.aws.identity-management"
+       sha                          = (known after apply)
    }

  # module.repositories["sudoblark.terraform.ci-cd-observability-monitoring"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (C) Sudoblark Ltd, Inc - All Rights Reserved
            Unauthorized copying of this file, via any medium is strictly prohibited
            Proprietary and confidential
            Written by Benjamin Clark <bclark@sudoblark.com>, 2026
        EOT -> (known after apply)
        id                  = "sudoblark.terraform.ci-cd-observability-monitoring/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.github"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.terraform.github/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.github.organisation"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.terraform.github.organisation/LICENSE.txt"
#        (8 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT -> (known after apply)
        id                  = "sudoblark.terraform.modularised-demo/LICENSE.txt"
#        (10 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.api_gateway"].github_repository_file.license will be updated in-place
!~  resource "github_repository_file" "license" {
!~      content             = <<-EOT
            Copyright (c) 2026, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #851](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/21767772180)